window.newsData = [
    {
        "id": "ap1",
        "title": "Tirupati: భూమనకు పల్లా శ్రీనివాస్ సవాల్స్",
        "category": "Andhra Pradesh",
        "date": "2025-04-17",
        "time": "02:15 PM",
        "image": "/kuwaitnews/images/news1.jpg",
        "alt": "News",
        "excerpt": "తిరుమల తిరుపతి దేవస్థానం గోశాలకు గుంపులుగా రావద్దని వైసీపీ నేతలకు తిరుపతి పోలీసు...",
        "fullText": "తిరుమల తిరుపతి దేవస్థానం గోశాలకు గుంపులుగా రావద్దని వైసీపీ నేతలకు తిరుపతి పోలీసుల సూచించారు. టీటీడీ గోశాలలో గోవుల మృతికి సంబంధించి కూటమి ప్రజా ప్రతినిధులు.. తిరుపతి మాజీ ఎమ్మెల్యే సవాళ్లపై పోలీసు శాఖ గురువారం ఈ ప్రకటన విడుదల చేసింది. కార్యకర్తలతో కాకుండా గన్ మెన్‌లతో గోశాలను సందర్శించి, మీడియాతో మాట్లాడి శాంతి భద్రతలకు విఘాతం కలగకుండా వెళ్లిపోవాలని భూమన కరుణాకరరెడ్డికి పోలీసులు సూచించారు。"
    },
    {
        "id": "ap2",
        "title": "Minister Narayana: వారికి కీలక బాధ్యతలు అప్పగిస్తాం.. మంత్రి నారాయణ...",
        "category": "Andhra Pradesh",
        "date": "2025-04-03",
        "time": "09:00 AM",
        "image": "/kuwaitnews/images/news2.jpg",
        "alt": "News",
        "excerpt": "Minister Narayana: డ్రైయిన్లు పూడిక తీత పనులు వెంటనే ప్రారంభించాలని...",
        "fullText": "అమరావతి: ఏపీలోని మున్సిపల్ కమిషనర్లతో ఇవాళ(శనివారం)..."
    }
];
